{"modelTopology":{"class_name":"Model","config":{"name":"model169","layers":[{"name":"decoder_inputs","class_name":"InputLayer","config":{"batch_input_shape":[null,284,6],"dtype":"float32","sparse":false,"name":"decoder_inputs"},"inbound_nodes":[]},{"name":"lstm_LSTM114","class_name":"LSTM","config":{"units":6,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM114","trainable":true},"inbound_nodes":[[["decoder_inputs",0,0,{}]]]},{"name":"decoder_dense_model_A","class_name":"Dense","config":{"units":6,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"decoder_dense_model_A","trainable":true},"inbound_nodes":[[["lstm_LSTM114",0,0,{}]]]}],"input_layers":[["decoder_inputs",0,0]],"output_layers":[["decoder_dense_model_A",0,0]]},"keras_version":"tfjs-layers 0.7.4","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"lstm_LSTM114/kernel","shape":[6,24],"dtype":"float32"},{"name":"lstm_LSTM114/recurrent_kernel","shape":[6,24],"dtype":"float32"},{"name":"lstm_LSTM114/bias","shape":[24],"dtype":"float32"},{"name":"decoder_dense_model_A/kernel","shape":[6,6],"dtype":"float32"},{"name":"decoder_dense_model_A/bias","shape":[6],"dtype":"float32"}]}]}